import { QuestionData } from './game-types';

export const QUESTIONS_DATA: QuestionData[] = [
  {
    "letter": "س",
    "question": "ما اسم البهار الذي يُستخرج من بذور نبات الكزبرة ويُستخدم في الطهي؟",
    "correctAnswer": "السمسم",
    "id": 1
  },
  {
    "letter": "ل",
    "question": "ما اسم الفاكهة الحمضية الصفراء التي تُستخدم في العصير والطهي؟",
    "correctAnswer": "الليمون",
    "id": 2
  },
  {
    "letter": "ل",
    "question": "ما اسم النبات الذي يُعرف بزهوره الأرجوانية الجميلة ويُستخدم في الزينة والعطور؟",
    "correctAnswer": "اللافندر",
    "id": 3
  },
  {
    "letter": "ض",
    "question": "ما اسم النبات الذي يُعرف بثماره الشوكية ويُستخدم في بعض الأدوية التقليدية؟",
    "correctAnswer": "الضريع",
    "id": 4
  },
  {
    "letter": "ض",
    "question": "ما هو النبات الذي يُعرف بأوراقه الخضراء الداكنة ويُستخدم في تزيين الحدائق؟",
    "correctAnswer": "الضيمران",
    "id": 5
  },
  {
    "letter": "ض",
    "question": "ما اسم النبات العشبي الذي يُستخدم في الطب الشعبي لعلاج بعض الأمراض؟",
    "correctAnswer": "الضرم",
    "id": 6
  },
  {
    "letter": "غ",
    "question": "ما اسم النبات الذي يُعرف بزهوره الصفراء الزاهية ويُستخدم في الزينة؟",
    "correctAnswer": "الغرنوقي",
    "id": 7
  },
  {
    "letter": "غ",
    "question": "ما هو النبات الذي يُعرف برائحته القوية ويُستخدم في طرد الحشرات؟",
    "correctAnswer": "الغرغار",
    "id": 8
  },
  {
    "letter": "ص",
    "question": "ما اسم الشجرة التي تُعرف بخشبها الصلب وتُستخدم في صناعة الأثاث؟",
    "correctAnswer": "الصنوبر",
    "id": 9
  },
  {
    "letter": "م",
    "question": "ما هو المحيط الذي يقع بين قارات آسيا وأستراليا والأمريكتين؟",
    "correctAnswer": "المحيط الهادئ",
    "id": 10
  },
  {
    "letter": "م",
    "question": "ما هي المدينة المغربية التي تشتهر بساحة جامع الفنا وتعتبر وجهة سياحية رئيسية؟",
    "correctAnswer": "مراكش",
    "id": 11
  },
  {
    "letter": "ت",
    "question": "ما هي المدينة التونسية التي تشتهر بآثار قرطاج التاريخية؟",
    "correctAnswer": "تونس",
    "id": 12
  },
  {
    "letter": "غ",
    "question": "ما اسم الغزوة التي وقعت في السنة الخامسة للهجرة وسميت بهذا الاسم نسبة إلى الخندق الذي حفره المسلمون؟",
    "correctAnswer": "غزوة الأحزاب",
    "id": 13
  },
  {
    "letter": "غ",
    "question": "ما هو الغضب المذموم في الإسلام؟",
    "correctAnswer": "الغضب الذي يؤدي إلى الإثم",
    "id": 14
  },
  {
    "letter": "ل",
    "question": "في أي ليلة من ليالي رمضان هي خير من ألف شهر؟",
    "correctAnswer": "ليلة القدر",
    "id": 15
  },
  {
    "letter": "ر",
    "question": "ما اسم الروضة الشريفة التي تقع في المسجد النبوي؟",
    "correctAnswer": "الروضة الشريفة",
    "id": 16
  },
  {
    "letter": "ت",
    "question": "ما اسم الكتاب الذي أنزل على النبي موسى عليه السلام؟",
    "correctAnswer": "التوراة",
    "id": 17
  },
  {
    "letter": "ت",
    "question": "ما هو التكبير الذي يقال في بداية الصلاة؟",
    "correctAnswer": "تكبيرة الإحرام",
    "id": 18
  },
  {
    "letter": "ر",
    "question": "ما هو العنصر الكيميائي الذي يُرمز له بالرمز Ra؟",
    "correctAnswer": "الراديوم",
    "id": 19
  },
  {
    "letter": "ق",
    "question": "ما هو العضو الذي يضخ الدم في جسم الإنسان؟",
    "correctAnswer": "القلب",
    "id": 20
  },
  {
    "letter": "ق",
    "question": "ما هو الجزء من العين الذي يتحكم في كمية الضوء التي تدخلها؟",
    "correctAnswer": "القزحية",
    "id": 21
  },
  {
    "letter": "ظ",
    "question": "ما هو الظل الذي يستظل به المؤمنون يوم القيامة؟",
    "correctAnswer": "ظل الرحمن",
    "id": 22
  },
  {
    "letter": "م",
    "question": "ما اسم السورة التي سميت على اسم والدة نبي الله عيسى عليه السلام؟",
    "correctAnswer": "مريم",
    "id": 23
  },
  {
    "letter": "م",
    "question": "ما اسم المدينة التي هاجر إليها النبي محمد صلى الله عليه وسلم من مكة؟",
    "correctAnswer": "المدينة المنورة",
    "id": 24
  },
  {
    "letter": "ن",
    "question": "ما هو النهر الذي يمر بالعاصمة المصرية القاهرة؟",
    "correctAnswer": "النيل",
    "id": 25
  },
  {
    "letter": "ن",
    "question": "ما هي الدولة الاسكندنافية التي تشتهر بالمضايق البحرية (الفيوردات)؟",
    "correctAnswer": "النرويج",
    "id": 26
  },
  {
    "letter": "ن",
    "question": "ما هي عاصمة الهند؟",
    "correctAnswer": "نيودلهي",
    "id": 27
  },
  {
    "letter": "ن",
    "question": "ما هي الدولة التي تقع في أقصى شمال أوروبا وتعرف بأرض الشمس منتصف الليل؟",
    "correctAnswer": "النرويج",
    "id": 28
  },
  {
    "letter": "ز",
    "question": "ما هي الظاهرة الطبيعية التي تحدث عندما تتصادم الصفائح التكتونية وتتحرك الأرض؟",
    "correctAnswer": "الزلازل",
    "id": 29
  },
  {
    "letter": "ز",
    "question": "ما هي المادة التي تستخدم في صناعة البطاريات وتُعرف بأنها معدن ثقيل؟",
    "correctAnswer": "الزنك",
    "id": 30
  },
  {
    "letter": "خ",
    "question": "ما هو الاسم الآخر لـ'الخليج العربي'؟",
    "correctAnswer": "خليج البصرة",
    "id": 31
  },
  {
    "letter": "خ",
    "question": "مدينة عربية تشتهر بوجود جبل 'خندمة'؟",
    "correctAnswer": "خميس مشيط",
    "id": 32
  },
  {
    "letter": "ح",
    "question": "ما هي المدينة التي تُعرف بأنها 'عاصمة الصحراء' في الجزائر؟",
    "correctAnswer": "حاسي مسعود",
    "id": 33
  },
  {
    "letter": "ع",
    "question": "ما هي المدينة الأردنية المعروفة بآثارها الرومانية القديمة؟",
    "correctAnswer": "عمان",
    "id": 34
  },
  {
    "letter": "ن",
    "question": "ما هي أول سورة في الجزء الثلاثين من القرآن الكريم؟",
    "correctAnswer": "النبأ",
    "id": 35
  },
  {
    "letter": "ض",
    "question": "ما هو الاسم الذي يطلق على من يضل عن طريق الحق؟",
    "correctAnswer": "الضال",
    "id": 36
  },
  {
    "letter": "ي",
    "question": "من هو النبي الذي ألقي في البئر ثم أصبح عزيز مصر؟",
    "correctAnswer": "يوسف",
    "id": 37
  },
  {
    "letter": "ج",
    "question": "ما هي الدولة العربية التي تقع في القرن الأفريقي وتطل على البحر الأحمر؟",
    "correctAnswer": "جيبوتي",
    "id": 38
  },
  {
    "letter": "ج",
    "question": "ما هو الجبل الأعلى في العالم؟",
    "correctAnswer": "جبل إيفرست",
    "id": 39
  },
  {
    "letter": "ج",
    "question": "ما هي المدينة التي تشتهر بوجود الأهرامات في مصر؟",
    "correctAnswer": "الجيزة",
    "id": 40
  },
  {
    "letter": "ج",
    "question": "ما هو المضيق الذي يربط البحر الأبيض المتوسط بالمحيط الأطلسي؟",
    "correctAnswer": "جبل طارق",
    "id": 41
  },
  {
    "letter": "ذ",
    "question": "ما هو عنصر كيميائي رمزه Au؟",
    "correctAnswer": "الذهب",
    "id": 42
  },
  {
    "letter": "و",
    "question": "ما هو اسم الوادي العظيم في الولايات المتحدة الأمريكية؟",
    "correctAnswer": "الوادي الكبير",
    "id": 43
  },
  {
    "letter": "ن",
    "question": "ما اسم النهر الذي يتدفق عبر الأمازون؟",
    "correctAnswer": "نهر الأمازون",
    "id": 44
  },
  {
    "letter": "ن",
    "question": "ما اسم السورة القرآنية التي تعني 'النساء'؟",
    "correctAnswer": "النساء",
    "id": 45
  },
  {
    "letter": "ن",
    "question": "ما هو الاسم الآخر ليوم القيامة في القرآن الكريم؟",
    "correctAnswer": "النازعة",
    "id": 46
  },
  {
    "letter": "أ",
    "question": "من هو النبي الذي بنى الكعبة المشرفة مع ابنه إسماعيل؟",
    "correctAnswer": "إبراهيم",
    "id": 47
  },
  {
    "letter": "ب",
    "question": "ما هو اسم الصحابي الذي كان مؤذن الرسول صلى الله عليه وسلم؟",
    "correctAnswer": "بلال بن رباح",
    "id": 48
  },
  {
    "letter": "ب",
    "question": "ما هو اسم السورة القرآنية التي تعني 'البقرة'؟",
    "correctAnswer": "البقرة",
    "id": 49
  },
  {
    "letter": "و",
    "question": "ما هو اسم الوحي الذي نزل على الأنبياء والرسل؟",
    "correctAnswer": "الوحي",
    "id": 50
  },
  {
    "letter": "و",
    "question": "ما هو اسم الصحابي الجليل الذي لقب بسيد الشهداء في غزوة أحد؟",
    "correctAnswer": "وحشي بن حرب",
    "id": 51
  },
  {
    "letter": "ي",
    "question": "ما هو اسم اليوم الذي يقوم فيه الناس من قبورهم للحساب؟",
    "correctAnswer": "يوم القيامة",
    "id": 52
  },
  {
    "letter": "ط",
    "question": "ما اسم السورة القرآنية التي تعني 'الجبال'؟",
    "correctAnswer": "الطور",
    "id": 53
  },
  {
    "letter": "ج",
    "question": "ما اسم الجبل الذي كلم الله عليه موسى عليه السلام؟",
    "correctAnswer": "جبل الطور",
    "id": 54
  },
  {
    "letter": "ج",
    "question": "ما هو اسم الوحي الذي نزل على الأنبياء؟",
    "correctAnswer": "جبريل",
    "id": 55
  },
  {
    "letter": "س",
    "question": "ما هي السورة التي بدأت بـ 'سبح اسم ربك الأعلى'؟",
    "correctAnswer": "سورة الأعلى",
    "id": 56
  },
  {
    "letter": "أ",
    "question": "ما هي القارة التي تضم دول مثل مصر والمغرب وجنوب أفريقيا؟",
    "correctAnswer": "أفريقيا",
    "id": 57
  },
  {
    "letter": "أ",
    "question": "ما هي الدولة التي تقع في جنوب شرق آسيا وتشتهر بوجود العديد من الجزر؟",
    "correctAnswer": "إندونيسيا",
    "id": 58
  },
  {
    "letter": "ب",
    "question": "ما اسم العملية التي تحول فيها النباتات ضوء الشمس إلى طاقة؟",
    "correctAnswer": "البناء الضوئي",
    "id": 59
  },
  {
    "letter": "ص",
    "question": "ما هو الركن الثاني من أركان الإسلام؟",
    "correctAnswer": "الصلاة",
    "id": 60
  },
  {
    "letter": "ص",
    "question": "ما هو العمل الذي يجزيه الله أجرًا عظيمًا ويُعد من أفضل الأعمال الصالحة؟",
    "correctAnswer": "الصدقة",
    "id": 61
  },
  {
    "letter": "س",
    "question": "ما هي السورة التي تُقرأ في كل ركعة من الصلاة؟",
    "correctAnswer": "سورة الفاتحة",
    "id": 62
  },
  {
    "letter": "ذ",
    "question": "ما هو الاسم الذي أطلق على القرآن الكريم لأنه يذكّر الناس بالحق؟",
    "correctAnswer": "الذكر",
    "id": 63
  },
  {
    "letter": "ذ",
    "question": "ما هو أحد أسماء الله الحسنى الذي يدل على القوة والعظمة؟",
    "correctAnswer": "ذو الجلال والإكرام",
    "id": 64
  },
  {
    "letter": "ذ",
    "question": "ما هو المصطلح الذي يطلق على من يدافع عن دينه ووطنه بشجاعة؟",
    "correctAnswer": "الذود",
    "id": 65
  },
  {
    "letter": "ز",
    "question": "ما هو الركن الثالث من أركان الإسلام؟",
    "correctAnswer": "الزكاة",
    "id": 66
  },
  {
    "letter": "ط",
    "question": "ما هو النبات الذي يُعرف بأنه من الفصيلة الباذنجانية وله ثمار أرجوانية أو بيضاء؟",
    "correctAnswer": "طماطم",
    "id": 67
  },
  {
    "letter": "ط",
    "question": "ما اسم الشجرة التي تنتج ثمارًا حلوة المذاق ولها استخدامات عديدة في الصناعات الغذائية؟",
    "correctAnswer": "طلح",
    "id": 68
  },
  {
    "letter": "ط",
    "question": "ما هو النبات الذي يستخدم في صناعة زيت الطعام ويُزرع على نطاق واسع في المناطق المعتدلة؟",
    "correctAnswer": "طحينة",
    "id": 69
  },
  {
    "letter": "ط",
    "question": "ما هو نوع من الحشائش البرية التي تنمو في الصحاري وتستخدم كعلف للحيوانات؟",
    "correctAnswer": "طرفة",
    "id": 70
  },
  {
    "letter": "ص",
    "question": "ما هو النبات الذي يُستخدم بذوره في صناعة الزيوت ويُعرف بزهوره الصفراء الزاهية؟",
    "correctAnswer": "صبار",
    "id": 71
  },
  {
    "letter": "ص",
    "question": "ما اسم الشجرة دائمة الخضرة التي تنتج ثمارًا تستخدم في صناعة المخللات والزيوت؟",
    "correctAnswer": "صنوبر",
    "id": 72
  },
  {
    "letter": "ص",
    "question": "ما هو النبات العطري الذي يُستخدم في الطهي وله أوراق خضراء صغيرة ورائحة قوية؟",
    "correctAnswer": "صعتر",
    "id": 73
  },
  {
    "letter": "ص",
    "question": "ما هو النبات الذي ينمو في المناطق الجافة ويُستخدم في الطب الشعبي لعلاج بعض الأمراض؟",
    "correctAnswer": "صمغ",
    "id": 74
  },
  {
    "letter": "ص",
    "question": "ما هو النبات الذي يُزرع في الحقول لإنتاج الحبوب ويُعتبر غذاءً أساسيًا للكثير من الشعوب؟",
    "correctAnswer": "صويا",
    "id": 75
  },
  {
    "letter": "ت",
    "question": "ما هي الفاكهة الحلوة التي تنمو على أشجار النخيل وتُعتبر غذاءً أساسيًا في العديد من الثقافات؟",
    "correctAnswer": "تمر",
    "id": 76
  },
  {
    "letter": "ت",
    "question": "ما هو النبات العشبي الذي يُعرف بزهوره الحمراء أو البيضاء ويُستخدم في تزيين الحدائق؟",
    "correctAnswer": "توليب",
    "id": 77
  },
  {
    "letter": "ت",
    "question": "ما هو النبات الذي يُستخرج منه الزيت ويُستخدم في صناعة الصابون ومستحضرات التجميل؟",
    "correctAnswer": "تبغ",
    "id": 78
  },
  {
    "letter": "و",
    "question": "ما هو النبات الذي ينمو في المناطق الاستوائية ويُعرف بثماره الكبيرة التي تُستخدم في الطهي؟",
    "correctAnswer": "ورق موز",
    "id": 79
  },
  {
    "letter": "و",
    "question": "ما هو النبات الذي يُزرع في الماء ويُستخدم كغذاء للأسماك والطيور المائية؟",
    "correctAnswer": "ورد النيل",
    "id": 80
  },
  {
    "letter": "و",
    "question": "ما هو النبات العطري الذي يُستخدم في صناعة العطور وله أزهار بيضاء أو وردية؟",
    "correctAnswer": "ورد",
    "id": 81
  },
  {
    "letter": "و",
    "question": "ما هو النبات الذي يُعرف بثماره المدورة ذات اللون الأحمر أو الأخضر ويُستخدم في صناعة العصائر؟",
    "correctAnswer": "ورشان",
    "id": 82
  },
  {
    "letter": "س",
    "question": "ما اسم السورة التي تبدأ بـ 'سبح اسم ربك الأعلى'؟",
    "correctAnswer": "سورة الأعلى",
    "id": 83
  },
  {
    "letter": "ق",
    "question": "ما اسم الكتاب المقدس للمسلمين؟",
    "correctAnswer": "القرآن",
    "id": 84
  },
  {
    "letter": "ت",
    "question": "ما اسم السورة التي سميت باسم فاكهة؟",
    "correctAnswer": "التين",
    "id": 85
  },
  {
    "letter": "ج",
    "question": "ما هو الاسم الآخر الذي يطلق على جبل إيفرست؟",
    "correctAnswer": "جومولانغما",
    "id": 86
  },
  {
    "letter": "ص",
    "question": "ما هي الدولة التي تشتهر بوجود سور الصين العظيم؟",
    "correctAnswer": "الصين",
    "id": 87
  },
  {
    "letter": "ت",
    "question": "ما هي عاصمة تونس؟",
    "correctAnswer": "تونس",
    "id": 88
  },
  {
    "letter": "ت",
    "question": "ما هو اسم الجزيرة الكبيرة التي تقع جنوب شرق أستراليا؟",
    "correctAnswer": "تسمانيا",
    "id": 89
  },
  {
    "letter": "ث",
    "question": "ما هو النبات الذي يُعرف أحيانًا باسم 'نبات اللؤلؤ' وله أوراق سميكة تشبه الكرات الصغيرة؟",
    "correctAnswer": "الثوم",
    "id": 90
  },
  {
    "letter": "ث",
    "question": "نبات ينتمي إلى الفصيلة البقولية، أوراقه مركبة وتُستخدم بذوره في الطهي وكعلف للحيوانات، ما هو؟",
    "correctAnswer": "الثيل",
    "id": 91
  },
  {
    "letter": "ث",
    "question": "نبات عشبي معمر ينمو في التربة الرملية، وله أزهار صفراء صغيرة، ما هو؟",
    "correctAnswer": "الثمام",
    "id": 92
  },
  {
    "letter": "ث",
    "question": "ما هو النبات الذي يُستخدم في صناعة الألياف ويُعرف بمتانته وقوته؟",
    "correctAnswer": "الثُّيول",
    "id": 93
  },
  {
    "letter": "أ",
    "question": "ما هو اسم الفاكهة الاستوائية ذات اللون الأصفر والطعم الحلو؟",
    "correctAnswer": "الأناناس",
    "id": 94
  },
  {
    "letter": "ر",
    "question": "ما هو العنصر الكيميائي الذي يرمز له بالرمز 'Ra'؟",
    "correctAnswer": "الراديوم",
    "id": 95
  },
  {
    "letter": "ي",
    "question": "ما هو العنصر الكيميائي الذي يرمز له بالرمز 'I'؟",
    "correctAnswer": "اليود",
    "id": 96
  },
  {
    "letter": "و",
    "question": "ما هو الغاز المسؤول عن ظاهرة الاحتباس الحراري بشكل رئيسي؟",
    "correctAnswer": "وثاني أكسيد الكربون",
    "id": 97
  },
  {
    "letter": "هـ",
    "question": "ما هو الاسم العلمي لعملية التنفس الخلوي؟",
    "correctAnswer": "الهدم",
    "id": 98
  },
  {
    "letter": "أ",
    "question": "ما هو الغاز الذي تتنفسه الكائنات الحية للحصول على الطاقة؟",
    "correctAnswer": "الأكسجين",
    "id": 99
  },
  {
    "letter": "أ",
    "question": "ما هو اسم العملية التي تتكاثر بها البكتيريا؟",
    "correctAnswer": "الانشطار الثنائي",
    "id": 100
  },
  {
    "letter": "هـ",
    "question": "ما هو العنصر الكيميائي الذي رمزه H ويعد أخف العناصر على الإطلاق؟",
    "correctAnswer": "الهيدروجين",
    "id": 101
  },
  {
    "letter": "ص",
    "question": "ما اسم الصحراء الكبرى التي تغطي جزءاً كبيراً من شمال إفريقيا؟",
    "correctAnswer": "الصحراء الكبرى",
    "id": 102
  },
  {
    "letter": "م",
    "question": "ما اسم المحيط الذي يقع بين قارتي أمريكا الشمالية والجنوبية وأوروبا وأفريقيا؟",
    "correctAnswer": "المحيط الأطلسي",
    "id": 103
  },
  {
    "letter": "م",
    "question": "ما اسم الدولة العربية التي تقع في أقصى الشمال الغربي لأفريقيا؟",
    "correctAnswer": "المغرب",
    "id": 104
  },
  {
    "letter": "ي",
    "question": "ما هي الدولة التي تشتهر بوجود جبل فوجي؟",
    "correctAnswer": "اليابان",
    "id": 105
  },
  {
    "letter": "ت",
    "question": "ما هي الدولة التي تقع عاصمتها أنقرة؟",
    "correctAnswer": "تركيا",
    "id": 106
  },
  {
    "letter": "ت",
    "question": "ما هي الدولة الواقعة في جنوب شرق آسيا وتشتهر بمعابدها القديمة؟",
    "correctAnswer": "تايلاند",
    "id": 107
  },
  {
    "letter": "ب",
    "question": "ما اسم البحر الذي يفصل بين أوروبا وأفريقيا؟",
    "correctAnswer": "البحر الأبيض المتوسط",
    "id": 108
  },
  {
    "letter": "د",
    "question": "ما هي الدولة التي تشترك في حدودها مع الأردن وسوريا والعراق؟",
    "correctAnswer": "دولة فلسطين",
    "id": 109
  },
  {
    "letter": "د",
    "question": "ما هي المدينة التي تقع على نهر النيل وتشتهر بأهراماتها؟",
    "correctAnswer": "دهشور",
    "id": 110
  },
  {
    "letter": "د",
    "question": "ما هي الدولة الواقعة في شبه الجزيرة العربية وتشتهر بإنتاجها للنفط؟",
    "correctAnswer": "دولة الكويت",
    "id": 111
  },
  {
    "letter": "م",
    "question": "ما هو أكبر محيط في العالم؟",
    "correctAnswer": "المحيط الهادئ",
    "id": 112
  },
  {
    "letter": "م",
    "question": "ما هي المدينة المقدسة في الإسلام والتي تقع في المملكة العربية السعودية؟",
    "correctAnswer": "مكة المكرمة",
    "id": 113
  },
  {
    "letter": "م",
    "question": "ما هي الدولة العربية التي تقع في القرن الأفريقي؟",
    "correctAnswer": "مصر",
    "id": 114
  },
  {
    "letter": "ح",
    "question": "ما هي المدينة السورية التي تشتهر بآثارها الرومانية؟",
    "correctAnswer": "حمص",
    "id": 115
  },
  {
    "letter": "ح",
    "question": "ما هو العنصر الكيميائي الذي رمزه Fe؟",
    "correctAnswer": "الحديد",
    "id": 116
  },
  {
    "letter": "ص",
    "question": "ما هو الصوت الذي ينتج عن اهتزاز الأجسام؟",
    "correctAnswer": "الصوت",
    "id": 117
  },
  {
    "letter": "ذ",
    "question": "ما هو النبات الذي يُعرف بـ 'اللسان' ويستخدم في الطب الشعبي؟",
    "correctAnswer": "ذيل الحصان",
    "id": 118
  },
  {
    "letter": "ذ",
    "question": "نوع من الحبوب ينمو في المناطق الحارة ويستخدم في صناعة الخبز؟",
    "correctAnswer": "ذرة",
    "id": 119
  },
  {
    "letter": "ذ",
    "question": "فاكهة استوائية لها شكل بيضاوي ولون أصفر أو برتقالي من الداخل؟",
    "correctAnswer": "ذرة صفراء",
    "id": 120
  },
  {
    "letter": "ذ",
    "question": "نبات عشبي معمر يزرع لزهوره العطرية وغالباً ما يستخدم في صناعة الشاي؟",
    "correctAnswer": "ذنب الأسد",
    "id": 121
  },
  {
    "letter": "ذ",
    "question": "ما هو الاسم الآخر لنبات 'الخروع'؟",
    "correctAnswer": "ذرة الخروع",
    "id": 122
  },
  {
    "letter": "ح",
    "question": "ما هو النبات العشبي الذي يستخدم لإضافة نكهة مميزة للطعام، ويُعرف بفوائده الصحية؟",
    "correctAnswer": "حبق",
    "id": 123
  },
  {
    "letter": "ح",
    "question": "فاكهة صيفية ذات قشرة خضراء ولب أحمر يحتوي على بذور سوداء؟",
    "correctAnswer": "حبحب",
    "id": 124
  },
  {
    "letter": "ح",
    "question": "ما هو النبات الذي ينمو على شكل شجيرة ويستخدم زهوره في صناعة العطور؟",
    "correctAnswer": "حناء",
    "id": 125
  },
  {
    "letter": "ح",
    "question": "نوع من البقوليات يزرع في الشتاء ويستخدم في العديد من الأطباق؟",
    "correctAnswer": "حمص",
    "id": 126
  },
  {
    "letter": "ح",
    "question": "ما هو النبات الذي يتميز بأوراقه العطرية ويستخدم في تتبيل اللحوم والأسماك؟",
    "correctAnswer": "حصرم",
    "id": 127
  },
  {
    "letter": "ج",
    "question": "فاكهة استوائية كبيرة ذات قشرة خضراء شائكة ولب أصفر حلو؟",
    "correctAnswer": "جاك فروت",
    "id": 128
  },
  {
    "letter": "ج",
    "question": "نوع من المكسرات ينمو على الأشجار ويستخدم في الحلويات؟",
    "correctAnswer": "جوز",
    "id": 129
  },
  {
    "letter": "ج",
    "question": "فاكهة حمضية صغيرة الحجم، لونها برتقالي ولها طعم حامض حلو؟",
    "correctAnswer": "جريب فروت",
    "id": 130
  },
  {
    "letter": "ق",
    "question": "ما هو النبات الذي تُستخدم أوراقه في السلطات وله طعم مر قليلاً؟",
    "correctAnswer": "قثاء",
    "id": 131
  },
  {
    "letter": "ق",
    "question": "نوع من البقوليات يزرع في الحقول ويستخدم بذوره كطعام؟",
    "correctAnswer": "قمح",
    "id": 132
  },
  {
    "letter": "ق",
    "question": "ما هو النبات الذي ينمو في المناطق الصحراوية ويستخدم ثماره كغذاء؟",
    "correctAnswer": "قرع",
    "id": 133
  },
  {
    "letter": "ق",
    "question": "فاكهة ذات قشرة سميكة ولون أخضر أو أصفر، ولبها حلو المذاق؟",
    "correctAnswer": "قشطة",
    "id": 134
  },
  {
    "letter": "ق",
    "question": "ما هو النبات الذي تُستخدم أزهاره في تلوين الطعام وإضافة نكهة مميزة؟",
    "correctAnswer": "قرنفل",
    "id": 135
  },
  {
    "letter": "د",
    "question": "ما اسم النبات الذي يُستخدم في صناعة الخبز ويُعرف بحبوبه الصغيرة؟",
    "correctAnswer": "دُخن",
    "id": 136
  },
  {
    "letter": "د",
    "question": "نبات يُستخدم في تزيين الحدائق وله أزهار جميلة بألوان متعددة، فما هو؟",
    "correctAnswer": "داليا",
    "id": 137
  },
  {
    "letter": "د",
    "question": "فاكهة استوائية ذات قشرة صلبة وشوكية ولب أبيض حلو المذاق، ما هي؟",
    "correctAnswer": "دوريان",
    "id": 138
  },
  {
    "letter": "د",
    "question": "ما هو النبات الذي يُعرف بثماره المدورة ذات اللون الأحمر أو الأصفر ويُزرع في المناطق الحارة؟",
    "correctAnswer": "دُراق",
    "id": 139
  },
  {
    "letter": "د",
    "question": "نبتة عطرية تُستخدم أوراقها في الطهي لإضافة نكهة مميزة، فما هي؟",
    "correctAnswer": "دوش",
    "id": 140
  },
  {
    "letter": "ض",
    "question": "نوع من النباتات الصحراوية التي تتحمل الجفاف وتتميز بأشواكها، ما اسمها؟",
    "correctAnswer": "ضَريم",
    "id": 141
  },
  {
    "letter": "ض",
    "question": "نبات عشبي يُستخدم في الطب الشعبي لعلاج بعض الأمراض ويُعرف بمرارة طعمه، ما هو؟",
    "correctAnswer": "ضَمران",
    "id": 142
  },
  {
    "letter": "ض",
    "question": "ما اسم النبات الذي يُعرف بزهوره الصغيرة البيضاء ويُستخدم في تزيين الأطباق؟",
    "correctAnswer": "ضَرم",
    "id": 143
  },
  {
    "letter": "ض",
    "question": "نبات يُزرع في المناطق الرطبة ويُستخدم علفًا للماشية، فما هو؟",
    "correctAnswer": "ضَعة",
    "id": 144
  },
  {
    "letter": "ض",
    "question": "نوع من النباتات البرية ذات الأوراق الصغيرة التي تنمو في السهول، ما اسمها؟",
    "correctAnswer": "ضَغابيس",
    "id": 145
  },
  {
    "letter": "ك",
    "question": "فاكهة استوائية كبيرة ذات قشرة خضراء صلبة ولب أصفر حلو، ما هي؟",
    "correctAnswer": "كاكايا",
    "id": 146
  },
  {
    "letter": "ك",
    "question": "نبات يُزرع لاستخراج الزيت من بذوره ويُستخدم أيضًا في صناعة الصابون، ما هو؟",
    "correctAnswer": "كتان",
    "id": 147
  },
  {
    "letter": "ك",
    "question": "نوع من الخضروات الورقية ذات الأوراق الخضراء الداكنة ويُعرف بفوائده الصحية، ما هو؟",
    "correctAnswer": "كرنب",
    "id": 148
  },
  {
    "letter": "ك",
    "question": "نبات شوكي صحراوي يُخزن الماء في ساقه ويُعرف بقدرته على تحمل الجفاف، ما اسمه؟",
    "correctAnswer": "كاكتوس",
    "id": 149
  },
  {
    "letter": "أ",
    "question": "فاكهة شتوية ذات قشرة صفراء أو برتقالية ولب حامض، ما هي؟",
    "correctAnswer": "أفوكادو",
    "id": 150
  },
  {
    "letter": "أ",
    "question": "نبات عشبي يُستخدم أوراقه في الطهي لإضافة نكهة مميزة ويُعرف برائحته العطرية، فما هو؟",
    "correctAnswer": "أوريجانو",
    "id": 151
  },
  {
    "letter": "أ",
    "question": "ما اسم الزهرة التي تُعرف بجمالها ورائحتها العطرة وتُزرع في الحدائق؟",
    "correctAnswer": "أقحوان",
    "id": 152
  },
  {
    "letter": "و",
    "question": "ما هي عاصمة بولندا؟",
    "correctAnswer": "وارسو",
    "id": 153
  },
  {
    "letter": "م",
    "question": "ما هو أكبر كوكب في المجموعة الشمسية؟",
    "correctAnswer": "المشتري",
    "id": 154
  },
  {
    "letter": "ق",
    "question": "ما هو اسم أول مسجد بني في الإسلام؟",
    "correctAnswer": "قباء",
    "id": 155
  },
  {
    "letter": "ح",
    "question": "ما هو الركن الخامس من أركان الإسلام الذي يؤدى مرة واحدة في العمر لمن استطاع إليه سبيلاً؟",
    "correctAnswer": "الحج",
    "id": 156
  },
  {
    "letter": "ح",
    "question": "ما اسم السورة القرآنية التي تعني 'الحديد'؟",
    "correctAnswer": "الحديد",
    "id": 157
  },
  {
    "letter": "ح",
    "question": "من هو الصحابي الجليل الملقب بـ 'أسد الله'؟",
    "correctAnswer": "حمزة بن عبد المطلب",
    "id": 158
  },
  {
    "letter": "ض",
    "question": "ما هو الاسم الذي يطلق على المادة التي خلقت منها الملائكة؟",
    "correctAnswer": "الضياء",
    "id": 159
  },
  {
    "letter": "ض",
    "question": "ما هو المصطلح الفقهي الذي يشير إلى الكفارة الواجبة على من أفطر في رمضان بغير عذر؟",
    "correctAnswer": "الضمان",
    "id": 160
  },
  {
    "letter": "أ",
    "question": "من هو أول الأنبياء والرسل؟",
    "correctAnswer": "آدم عليه السلام",
    "id": 161
  },
  {
    "letter": "ق",
    "question": "ما هو اسم الكتاب المقدس للمسلمين؟",
    "correctAnswer": "القرآن الكريم",
    "id": 162
  },
  {
    "letter": "ع",
    "question": "ما اسم الشجرة التي تُعرف بخشبها الثمين وتُستخدم في صناعة الأثاث الفاخر؟",
    "correctAnswer": "عود",
    "id": 163
  },
  {
    "letter": "ع",
    "question": "أي من هذه النباتات له استخدامات طبية ويُعرف بخصائصه المضادة للالتهابات؟",
    "correctAnswer": "عرق السوس",
    "id": 164
  },
  {
    "letter": "ع",
    "question": "ما هي الفاكهة التي تتميز بقشرتها الخشنة ولونها الأصفر أو البرتقالي وطعمها الحامض؟",
    "correctAnswer": "عنب",
    "id": 165
  },
  {
    "letter": "ع",
    "question": "ما هو الاسم الآخر لنبات الخردل الذي تُستخدم بذوره في التوابل؟",
    "correctAnswer": "عشبة الخردل",
    "id": 166
  },
  {
    "letter": "ع",
    "question": "ما هو النبات الذي يُستخرج منه زيت يُستخدم في الطهي والعناية بالبشرة؟",
    "correctAnswer": "عباد الشمس",
    "id": 167
  },
  {
    "letter": "ن",
    "question": "ما هي الشجرة التي تُعرف بإنتاجها للبلح والتمر؟",
    "correctAnswer": "نخلة",
    "id": 168
  },
  {
    "letter": "ن",
    "question": "ما هو النبات الذي يُستخدم في صناعة المنسوجات ويُعرف بأليافه القوية؟",
    "correctAnswer": "نبات القطن",
    "id": 169
  },
  {
    "letter": "ن",
    "question": "ما هي الزهرة التي تُعرف بجمالها ورائحتها العطرية وتُستخدم في صناعة العطور؟",
    "correctAnswer": "نرجس",
    "id": 170
  },
  {
    "letter": "ن",
    "question": "ما هو النبات الذي يُزرع في الماء ويُعرف بزهوره الكبيرة الجميلة؟",
    "correctAnswer": "نيلوفر",
    "id": 171
  },
  {
    "letter": "ن",
    "question": "ما اسم النبات الذي يُستخدم في تلوين الطعام ويُعرف بلونه الأحمر الداكن؟",
    "correctAnswer": "نجيل",
    "id": 172
  },
  {
    "letter": "ث",
    "question": "ما هي الفاكهة التي تُعرف بشكلها المثلث وطعمها الحلو؟",
    "correctAnswer": "ثمار التين الشوكي",
    "id": 173
  },
  {
    "letter": "ث",
    "question": "ما هو النبات الذي يُستخدم أوراقه في الشاي ويُعرف بخصائصه المهدئة؟",
    "correctAnswer": "ثوم",
    "id": 174
  },
  {
    "letter": "ث",
    "question": "ما هو الاسم الشائع لشجرة تُنتج فاكهة صغيرة حمراء أو سوداء تُستخدم في المربى؟",
    "correctAnswer": "ثمر العليق",
    "id": 175
  },
  {
    "letter": "ث",
    "question": "ما هو النبات الذي يُعتبر من التوابل ويُعرف برائحته القوية وطعمه الحار؟",
    "correctAnswer": "ثوم بري",
    "id": 176
  },
  {
    "letter": "ت",
    "question": "ما هي الفاكهة التي تُعرف بقشرتها الخضراء ولحمها الأحمر الحلو؟",
    "correctAnswer": "تفاح",
    "id": 177
  },
  {
    "letter": "ت",
    "question": "ما هو النبات الذي يُزرع في المناطق الاستوائية ويُعرف بحبوبه التي تُستخدم لصنع مشروب شهير؟",
    "correctAnswer": "توت",
    "id": 178
  },
  {
    "letter": "ت",
    "question": "ما هي الشجرة التي تُنتج ثمارًا حلوة تُعرف باسمها؟",
    "correctAnswer": "تين",
    "id": 179
  },
  {
    "letter": "ت",
    "question": "ما هو النبات الذي يُزرع في الحقول ويُستخدم حبوبه في صناعة الخبز؟",
    "correctAnswer": "تمر",
    "id": 180
  },
  {
    "letter": "ص",
    "question": "ما اسم الصلاة التي يؤديها المسلمون خمس مرات في اليوم؟",
    "correctAnswer": "الصلاة",
    "id": 181
  },
  {
    "letter": "ي",
    "question": "ما هو الاسم الآخر ليوم القيامة في القرآن الكريم؟",
    "correctAnswer": "يوم الحساب",
    "id": 182
  },
  {
    "letter": "ي",
    "question": "ما هو النبي الذي كان يُعرف بجماله؟",
    "correctAnswer": "يوسف",
    "id": 183
  },
  {
    "letter": "ف",
    "question": "ما اسم السورة القرآنية التي ذكر فيها قصة أصحاب الفيل؟",
    "correctAnswer": "الفيل",
    "id": 184
  },
  {
    "letter": "ف",
    "question": "ما اسم الفتح الإسلامي الذي كان سبباً في دخول أهل مكة في الإسلام؟",
    "correctAnswer": "فتح مكة",
    "id": 185
  },
  {
    "letter": "هـ",
    "question": "ما هو الاسم الآخر لسلسلة جبال الأنديز في أمريكا الجنوبية؟",
    "correctAnswer": "هضبة الأنديز",
    "id": 186
  },
  {
    "letter": "ق",
    "question": "ما هو النبات الذي يُعرف بـ 'ملك الفواكه' وله رائحة قوية ومميزة؟",
    "correctAnswer": "القشطة",
    "id": 187
  },
  {
    "letter": "ق",
    "question": "ما اسم النبات الذي يتميز بأوراقه الكبيرة ويستخدم في صناعة السجاد والحبال؟",
    "correctAnswer": "القنب",
    "id": 188
  },
  {
    "letter": "ق",
    "question": "نبات عشبي معمر ذو أزهار بيضاء أو وردية، يُستخدم في الطب الشعبي لعلاج بعض الأمراض، فما هو؟",
    "correctAnswer": "القراص",
    "id": 189
  },
  {
    "letter": "ق",
    "question": "ما هو النبات الذي يُعرف بزهوره الجميلة والمشرقة ويستخدم في الزينة؟",
    "correctAnswer": "القرنفل",
    "id": 190
  },
  {
    "letter": "و",
    "question": "ما هو النبات الذي يُعرف بأزهاره الجميلة ورائحته العطرة ويُستخدم في صناعة العطور؟",
    "correctAnswer": "الورد",
    "id": 191
  },
  {
    "letter": "ل",
    "question": "ما اسم الطبقة الخارجية للأرض التي تتكون من الصخور والمعادن؟",
    "correctAnswer": "اللب",
    "id": 192
  },
  {
    "letter": "ل",
    "question": "ما هو الاسم الآخر للمادة التي تتكون منها الكواكب والنجوم في الفضاء؟",
    "correctAnswer": "اللا شيء",
    "id": 193
  },
  {
    "letter": "ص",
    "question": "ما هي الدولة التي تشتهر بسورها العظيم؟",
    "correctAnswer": "الصين",
    "id": 194
  },
  {
    "letter": "ص",
    "question": "ما هو أكبر صحراء حارة في العالم؟",
    "correctAnswer": "الصحراء الكبرى",
    "id": 195
  },
  {
    "letter": "ع",
    "question": "ما هي عاصمة الأردن؟",
    "correctAnswer": "عمان",
    "id": 196
  },
  {
    "letter": "ص",
    "question": "ما هو النبات الذي يُعرف بزهوره العطرة ويُستخدم في صناعة العطور؟",
    "correctAnswer": "صندل",
    "id": 197
  },
  {
    "letter": "ص",
    "question": "ما هو النبات الذي تُستخدم بذوره في صناعة الخبز ويُعرف بأنه غني بالبروتين؟",
    "correctAnswer": "صويا",
    "id": 198
  },
  {
    "letter": "ك",
    "question": "ما هي العاصمة الإدارية لدولة الكويت؟",
    "correctAnswer": "الكويت",
    "id": 199
  },
  {
    "letter": "ب",
    "question": "ما هو البحر الذي يفصل بين قارتي أوروبا وأفريقيا؟",
    "correctAnswer": "البحر الأبيض المتوسط",
    "id": 200
  },
  {
    "letter": "ب",
    "question": "ما هي الدولة التي تقع في أمريكا الجنوبية وتشتهر بغابات الأمازون؟",
    "correctAnswer": "البرازيل",
    "id": 201
  },
  {
    "letter": "ص",
    "question": "ما هو النبات الذي يُعرف بأنه من الخضروات الجذرية ويُستخدم في السلطات والعصائر، ويتميز بلونه البرتقالي الفاتح؟",
    "correctAnswer": "صبار",
    "id": 202
  },
  {
    "letter": "ص",
    "question": "نبات عشبي ينمو في المناطق الجافة وشبه الجافة، وتُستخدم أوراقه في صناعة الألياف والحبال. ما هو؟",
    "correctAnswer": "الصبار",
    "id": 203
  },
  {
    "letter": "ص",
    "question": "ما اسم الشجرة التي تنتج ثمارًا حلوة المذاق، وتكون على شكل عناقيد، وتُستخدم في صناعة العصير والمربى؟",
    "correctAnswer": "صفصاف",
    "id": 204
  },
  {
    "letter": "ص",
    "question": "ما هو النبات الذي يُستخدم في الطب التقليدي لعلاج بعض الأمراض، ويُعرف بخصائصه المضادة للالتهابات؟",
    "correctAnswer": "الصبار",
    "id": 205
  },
  {
    "letter": "ص",
    "question": "نبات صحراوي يتميز بقدرته على تخزين الماء في أوراقه وسيقانه. ما هو؟",
    "correctAnswer": "صبار",
    "id": 206
  },
  {
    "letter": "ي",
    "question": "ما هو النبات الذي يُستخرج منه زيت يُستخدم في الطهي والعناية بالبشرة، ويُعرف بفوائده الصحية العديدة؟",
    "correctAnswer": "الياسمين",
    "id": 207
  },
  {
    "letter": "ي",
    "question": "نبات زينة يتميز بأزهاره البيضاء العطرية، ويُستخدم في صناعة العطور. ما هو؟",
    "correctAnswer": "الياسمين",
    "id": 208
  },
  {
    "letter": "ي",
    "question": "ما هو النبات الذي يُزرع في المناطق الاستوائية، وتُستخدم أوراقه في صناعة الشاي؟",
    "correctAnswer": "الينسون",
    "id": 209
  },
  {
    "letter": "ي",
    "question": "نبات عشبي عطري يُستخدم في الطهي وفي صناعة المشروبات المهدئة. ما هو؟",
    "correctAnswer": "الينسون",
    "id": 210
  },
  {
    "letter": "ي",
    "question": "ما هو النبات الذي تُستخدم جذوره في الطب التقليدي لعلاج بعض الأمراض، ويُعرف بخصائصه المضادة للأكسدة؟",
    "correctAnswer": "اليام",
    "id": 211
  },
  {
    "letter": "هـ",
    "question": "ما هي الشجرة التي تُعرف بخشبها الصلب والمتين، وتُستخدم في صناعة الأثاث؟",
    "correctAnswer": "هبهاب",
    "id": 212
  },
  {
    "letter": "هـ",
    "question": "نبات عشبي يُستخدم في الطب الشعبي لعلاج بعض الأمراض، ويُعرف بخصائصه المضادة للالتهابات. ما هو؟",
    "correctAnswer": "الهندباء",
    "id": 213
  },
  {
    "letter": "هـ",
    "question": "ما هو النبات الذي يُستخدم في صناعة العطور والزيوت العطرية، ويتميز برائحته الزكية؟",
    "correctAnswer": "الهيل",
    "id": 214
  },
  {
    "letter": "هـ",
    "question": "ما هي الشجرة التي تنتج ثمارًا تُستخدم في صناعة المشروبات الكحولية والخل؟",
    "correctAnswer": "الهوهوبا",
    "id": 215
  },
  {
    "letter": "هـ",
    "question": "نبات يُزرع في المناطق المعتدلة، وتُستخدم أوراقه في صناعة الشاي. ما هو؟",
    "correctAnswer": "الهيل",
    "id": 216
  },
  {
    "letter": "ج",
    "question": "ما هو النبات الذي يُعرف بأنه من الخضروات الجذرية ويُستخدم في الطهي والسلطات، ويتميز بلونه البرتقالي؟",
    "correctAnswer": "جزر",
    "id": 217
  },
  {
    "letter": "ج",
    "question": "نبات عشبي يُستخدم في الطب التقليدي لعلاج بعض الأمراض، ويُعرف بخصائصه المضادة للالتهابات. ما هو؟",
    "correctAnswer": "الجينسنغ",
    "id": 218
  },
  {
    "letter": "ج",
    "question": "ما هي الشجرة التي تنتج ثمارًا حلوة المذاق، وتكون على شكل عناقيد، وتُستخدم في صناعة العصير والمربى؟",
    "correctAnswer": "جميز",
    "id": 219
  },
  {
    "letter": "ج",
    "question": "ما هو النبات الذي تُستخدم أوراقه في صناعة الشاي، ويُعرف بفوائده الصحية العديدة؟",
    "correctAnswer": "الجينكو",
    "id": 220
  },
  {
    "letter": "ج",
    "question": "نبات استوائي يتميز بأوراقه الكبيرة واللامعة، ويُزرع كنبات زينة. ما هو؟",
    "correctAnswer": "الجهنمية",
    "id": 221
  },
  {
    "letter": "ك",
    "question": "ما هو النبات الذي يُعرف بـ 'ملك التوابل' ويُستخدم بذوره في الطهي؟",
    "correctAnswer": "كمون",
    "id": 222
  },
  {
    "letter": "ك",
    "question": "فاكهة استوائية كبيرة الحجم ذات قشرة خضراء صلبة ولُب أبيض صالح للأكل، فما هي؟",
    "correctAnswer": "كاكايا",
    "id": 223
  },
  {
    "letter": "ك",
    "question": "نبات عشبي مزهر يُزرع لزهوره الجميلة والمستخدمة في الزينة، ويُعرف أيضًا باسم 'الزنبق'.",
    "correctAnswer": "كالا",
    "id": 224
  },
  {
    "letter": "ك",
    "question": "ما هو النبات الذي تُستخرج منه ألياف طبيعية قوية تُستخدم في صناعة الحبال والأكياس؟",
    "correctAnswer": "كتان",
    "id": 225
  },
  {
    "letter": "ل",
    "question": "ما هي الفاكهة الحمضية المعروفة بطعمها اللاذع ولونها الأصفر أو الأخضر؟",
    "correctAnswer": "ليمون",
    "id": 226
  },
  {
    "letter": "ل",
    "question": "نبات مزهر يُستخدم في صناعة العطور ويُعرف برائحته العطرة ولونه الأرجواني؟",
    "correctAnswer": "لافندر",
    "id": 227
  },
  {
    "letter": "ل",
    "question": "شجرة استوائية تُنتج فاكهة بيضاوية الشكل ذات قشرة حمراء أو وردية ولُب أبيض شفاف؟",
    "correctAnswer": "ليتشي",
    "id": 228
  },
  {
    "letter": "خ",
    "question": "ما هي الخضروات الورقية الخضراء التي تُستخدم بكثرة في السلطات وتتميز بأوراقها المجعدة؟",
    "correctAnswer": "خس",
    "id": 229
  },
  {
    "letter": "خ",
    "question": "نبات عطري يُستخدم في الطهي ويُعرف برائحته النفاذة ويدخل في تركيب بعض البهارات؟",
    "correctAnswer": "خردل",
    "id": 230
  },
  {
    "letter": "ش",
    "question": "ما هي الفاكهة الاستوائية التي تُعرف بقشرتها الخضراء الشوكية ولُبها الأصفر العطري؟",
    "correctAnswer": "شوكولا",
    "id": 231
  },
  {
    "letter": "ش",
    "question": "نبات عطري يُستخدم في الطهي والمشروبات الساخنة ويُعرف بخصائصه المهدئة؟",
    "correctAnswer": "شاي",
    "id": 232
  },
  {
    "letter": "ش",
    "question": "ما هو النبات الذي يُزرع لزهوره الجميلة والمتنوعة الألوان ويُستخدم في تزيين الحدائق؟",
    "correctAnswer": "شجيرة",
    "id": 233
  },
  {
    "letter": "ش",
    "question": "نبات عشبي يُستخدم في بعض الأدوية التقليدية ويُعرف بأوراقه المسننة وزهوره الصفراء؟",
    "correctAnswer": "شيح",
    "id": 234
  },
  {
    "letter": "ش",
    "question": "ما هي الشجرة العملاقة التي تُعرف بإنتاج فاكهة ذات قشرة بنية صلبة ولُب أبيض صالح للأكل؟",
    "correctAnswer": "شجرة جوز الهند",
    "id": 235
  },
  {
    "letter": "ص",
    "question": "ما اسم الصحراء التي تغطي معظم أراضي المملكة العربية السعودية؟",
    "correctAnswer": "الصحراء العربية",
    "id": 236
  },
  {
    "letter": "خ",
    "question": "ما هو الخليج الذي يفصل شبه الجزيرة العربية عن إيران؟",
    "correctAnswer": "الخليج العربي",
    "id": 237
  },
  {
    "letter": "ب",
    "question": "ما هو الجزء الأساسي من الذرة الذي يحمل شحنة موجبة؟",
    "correctAnswer": "البروتون",
    "id": 238
  },
  {
    "letter": "ج",
    "question": "ما هو اسم الوحي الذي نزل على النبي محمد صلى الله عليه وسلم؟",
    "correctAnswer": "جبريل عليه السلام",
    "id": 239
  },
  {
    "letter": "ل",
    "question": "ما هي الدولة العربية التي تقع على الساحل الشرقي للبحر الأبيض المتوسط وتشتهر بأرزها؟",
    "correctAnswer": "لبنان",
    "id": 240
  },
  {
    "letter": "ج",
    "question": "ما اسم شجرة فاكهة استوائية ذات قشرة خضراء صلبة ولُب أبيض عطري؟",
    "correctAnswer": "جوافة",
    "id": 241
  },
  {
    "letter": "ج",
    "question": "ما اسم نبات عشبي له أوراق خضراء عريضة ويستخدم في السلطات والعديد من الأطباق؟",
    "correctAnswer": "جرجير",
    "id": 242
  },
  {
    "letter": "ش",
    "question": "ما اسم الشجرة التي تنتج ثمارًا حمراء صغيرة وحامضة، وتستخدم في صناعة المربى والعصائر؟",
    "correctAnswer": "شجر الكرز",
    "id": 243
  },
  {
    "letter": "ش",
    "question": "ما هو النبات الذي يُستخرج منه السكر ويُزرع في المناطق المعتدلة؟",
    "correctAnswer": "شمندر",
    "id": 244
  },
  {
    "letter": "ش",
    "question": "ما هو النبات العشبي الذي يُزرع في الحقول ويستخدم بذوره في صناعة الزيوت النباتية؟",
    "correctAnswer": "شيا",
    "id": 245
  },
  {
    "letter": "ش",
    "question": "ما اسم الشجيرة التي تتميز بأوراقها العطرية وتستخدم كبهار في الطهي، خاصة مع اللحوم؟",
    "correctAnswer": "شجيرة الروزماري",
    "id": 246
  },
  {
    "letter": "ش",
    "question": "ما هو نوع من الفطر الصالح للأكل، ينمو على جذوع الأشجار ويُعرف بقيمته الغذائية العالية؟",
    "correctAnswer": "شيتاكي",
    "id": 247
  },
  {
    "letter": "ل",
    "question": "ما اسم الشجرة التي تنتج ثمارًا حامضة صفراء اللون، وتستخدم في العصائر والطهي؟",
    "correctAnswer": "ليمون",
    "id": 248
  },
  {
    "letter": "ل",
    "question": "ما هي الفاكهة الاستوائية ذات القشرة الخشنة واللب الأبيض العصير الذي يحتوي على بذور سوداء صغيرة؟",
    "correctAnswer": "ليتشي",
    "id": 249
  },
  {
    "letter": "م",
    "question": "ما اسم الكتاب المقدس للمسلمين؟",
    "correctAnswer": "مصحف",
    "id": 250
  },
  {
    "letter": "م",
    "question": "ماذا يسمى المكان الذي يتجمع فيه المسلمون لأداء الصلاة؟",
    "correctAnswer": "مسجد",
    "id": 251
  },
  {
    "letter": "م",
    "question": "من هو النبي الذي أرسله الله إلى قوم فرعون؟",
    "correctAnswer": "موسى",
    "id": 252
  },
  {
    "letter": "ض",
    "question": "ماذا يسمى المكان الذي يضم رفات الأنبياء والصالحين؟",
    "correctAnswer": "ضريح",
    "id": 253
  },
  {
    "letter": "ص",
    "question": "ما هي أكبر صحراء في العالم من حيث المساحة؟",
    "correctAnswer": "الصحراء الكبرى",
    "id": 254
  },
  {
    "letter": "ب",
    "question": "ما هي أكبر بحيرة عذبة في العالم من حيث الحجم؟",
    "correctAnswer": "بحيرة بايكال",
    "id": 255
  },
  {
    "letter": "ب",
    "question": "ما هو اسم البحر الذي يفصل بين قارتي أوروبا وإفريقيا؟",
    "correctAnswer": "البحر الأبيض المتوسط",
    "id": 256
  },
  {
    "letter": "ب",
    "question": "ما هي عاصمة بلجيكا؟",
    "correctAnswer": "بروكسل",
    "id": 257
  },
  {
    "letter": "ل",
    "question": "ما هي الدولة التي تقع في شمال إفريقيا وتشتهر بأهراماتها؟",
    "correctAnswer": "ليبيا",
    "id": 258
  },
  {
    "letter": "ث",
    "question": "ما اسم ثمرة استوائية كبيرة بيضاوية الشكل، تتميز بلونها البني الغامق وقشرتها الخشنة، وتستخدم بذورها في صناعة الشوكولاتة؟",
    "correctAnswer": "الثمرة الكاكاوية",
    "id": 259
  },
  {
    "letter": "ث",
    "question": "ما هو النبات الذي يُعرف بـ 'الذهب السائل' ويُستخرج منه زيت ذو قيمة غذائية عالية؟",
    "correctAnswer": "الثوم",
    "id": 260
  },
  {
    "letter": "ث",
    "question": "ما اسم نبات عشبي ينمو في المناطق الجافة وشبه الجافة، ويستخدم في الطب الشعبي لعلاج بعض الأمراض؟",
    "correctAnswer": "الثيل",
    "id": 261
  },
  {
    "letter": "ث",
    "question": "ما هو الجزء من النبات الذي يقوم بامتصاص الماء والمعادن من التربة ويثبت النبات في الأرض؟",
    "correctAnswer": "الثمرة",
    "id": 262
  },
  {
    "letter": "ث",
    "question": "ما اسم نبات ورقي يُستخدم في السلطات ويتميز بنكهته اللاذعة؟",
    "correctAnswer": "الثفاء",
    "id": 263
  },
  {
    "letter": "ل",
    "question": "ما هي الثمرة التي تُعرف بـ 'ملكة الفواكه' وتنمو في المناطق الاستوائية، وتتميز بلونها الأخضر من الخارج ولحمها الأبيض من الداخل؟",
    "correctAnswer": "الليتشي",
    "id": 264
  },
  {
    "letter": "ل",
    "question": "ما هو النبات الذي يُعرف بـ 'نبات الشيطان' ويُستخدم في الطب الشعبي لعلاج بعض الأمراض، ولكنه سام إذا تم تناوله بكميات كبيرة؟",
    "correctAnswer": "اللبلاب السام",
    "id": 265
  },
  {
    "letter": "غ",
    "question": "ما هي الثمرة التي تُعرف بـ 'فاكهة الأغنياء' وتنمو في المناطق الاستوائية، وتتميز بلونها الأخضر من الخارج ولحمها الأصفر من الداخل؟",
    "correctAnswer": "الغوافة",
    "id": 266
  },
  {
    "letter": "د",
    "question": "ما هو اسم العملية التي يتبخر فيها الماء من سطح الأرض ثم يتكثف ويسقط على شكل مطر؟",
    "correctAnswer": "الدورة المائية",
    "id": 267
  },
  {
    "letter": "هـ",
    "question": "ما هو العنصر الكيميائي الذي رمزه H ويُعد أخف العناصر؟",
    "correctAnswer": "الهيدروجين",
    "id": 268
  },
  {
    "letter": "ن",
    "question": "ما هو الاسم العلمي للعملية التي يتم فيها فقدان الماء من أوراق النباتات على شكل بخار؟",
    "correctAnswer": "النتح",
    "id": 269
  },
  {
    "letter": "م",
    "question": "ما هو أضخم كوكب في المجموعة الشمسية؟",
    "correctAnswer": "المشتري",
    "id": 270
  },
  {
    "letter": "ق",
    "question": "ما هي الدولة التي تقع في شبه الجزيرة العربية وتطل على الخليج العربي؟",
    "correctAnswer": "قطر",
    "id": 271
  },
  {
    "letter": "م",
    "question": "ما هو المحيط الذي يحيط بالقطب الشمالي؟",
    "correctAnswer": "المحيط المتجمد الشمالي",
    "id": 272
  },
  {
    "letter": "م",
    "question": "ما هي الدولة العربية التي تقع في شمال إفريقيا وتشتهر بأهراماتها القديمة؟",
    "correctAnswer": "مصر",
    "id": 273
  },
  {
    "letter": "م",
    "question": "ما اسم السورة التي تبدأ بـ 'تبارك الذي بيده الملك'؟",
    "correctAnswer": "الملك",
    "id": 274
  },
  {
    "letter": "س",
    "question": "ما اسم الصحابي الذي أشار على النبي بحفر الخندق؟",
    "correctAnswer": "سلمان الفارسي",
    "id": 275
  },
  {
    "letter": "أ",
    "question": "من هو أول الخلفاء الراشدين؟",
    "correctAnswer": "أبو بكر الصديق",
    "id": 276
  },
  {
    "letter": "أ",
    "question": "من هو النبي الذي بنى الكعبة المشرفة مع ابنه إسماعيل؟",
    "correctAnswer": "إبراهيم",
    "id": 277
  },
  {
    "letter": "خ",
    "question": "ما هو عدد أركان الإسلام؟",
    "correctAnswer": "خمسة",
    "id": 278
  },
  {
    "letter": "م",
    "question": "ما هي الشجرة التي تُعرف بإنتاجها للفاكهة الحلوة وتنمو في المناطق الاستوائية؟",
    "correctAnswer": "المانجو",
    "id": 279
  },
  {
    "letter": "س",
    "question": "ما هو النبات الذي تُستخدم أوراقه في السلطات ويُعرف بفوائده الصحية العديدة؟",
    "correctAnswer": "السبانخ",
    "id": 280
  },
  {
    "letter": "ش",
    "question": "ما اسم الشجرة التي تُعرف بـ 'ملك الفواكه' ولها رائحة قوية ومميزة؟",
    "correctAnswer": "شجرة المانجو",
    "id": 281
  },
  {
    "letter": "ش",
    "question": "ما هي النبتة التي تُستخدم أوراقها في تحضير مشروب ساخن ومنبه؟",
    "correctAnswer": "شاي",
    "id": 282
  },
  {
    "letter": "ش",
    "question": "ما اسم الجزء من النبتة الذي ينمو تحت الأرض ويثبتها في التربة؟",
    "correctAnswer": "شُعيرات جذرية",
    "id": 283
  },
  {
    "letter": "ش",
    "question": "ما هي النبتة العطرية التي تستخدم في الطهي وتتميز بأوراقها الصغيرة الخضراء؟",
    "correctAnswer": "شبت",
    "id": 284
  },
  {
    "letter": "ش",
    "question": "ما اسم الزهرة التي تُعرف بجمالها وألوانها المتعددة، وغالبًا ما تُستخدم في تزيين الحدائق؟",
    "correctAnswer": "شقائق النعمان",
    "id": 285
  },
  {
    "letter": "ز",
    "question": "ما اسم الزهرة التي تُعرف بجمالها ورائحتها العطرة وتُستخدم في صناعة العطور؟",
    "correctAnswer": "الزنبق",
    "id": 286
  },
  {
    "letter": "ز",
    "question": "ما هو النبات الذي تُستخرج منه حبات صغيرة خضراء أو سوداء تُستخدم في إنتاج الزيت؟",
    "correctAnswer": "الزيتون",
    "id": 287
  },
  {
    "letter": "ز",
    "question": "ما هو النبات الذي تُستخدم أزهاره المجففة في تحضير مشروب مهدئ للأعصاب؟",
    "correctAnswer": "الزعتر",
    "id": 288
  },
  {
    "letter": "ن",
    "question": "ما هو الاسم الآخر لنهر النيل؟",
    "correctAnswer": "النيل",
    "id": 289
  },
  {
    "letter": "ن",
    "question": "ما هي المدينة التي تشتهر بكونها عاصمة النور؟",
    "correctAnswer": "نيويورك",
    "id": 290
  },
  {
    "letter": "ب",
    "question": "ما هي العاصمة التي تقع على نهر الدانوب؟",
    "correctAnswer": "بودابست",
    "id": 291
  },
  {
    "letter": "ب",
    "question": "ما هو أكبر بحر مغلق في العالم؟",
    "correctAnswer": "بحر قزوين",
    "id": 292
  },
  {
    "letter": "ب",
    "question": "ما هي المدينة التي تعتبر عاصمة البرازيل؟",
    "correctAnswer": "برازيليا",
    "id": 293
  },
  {
    "letter": "ت",
    "question": "ما هي عاصمة دولة تونس؟",
    "correctAnswer": "تونس",
    "id": 294
  },
  {
    "letter": "ق",
    "question": "ما هي أعلى قمة جبلية في العالم؟",
    "correctAnswer": "قمة إيفرست",
    "id": 295
  },
  {
    "letter": "ق",
    "question": "ما هو اسم القارة التي تضم دولتي كندا والولايات المتحدة الأمريكية؟",
    "correctAnswer": "قارة أمريكا الشمالية",
    "id": 296
  },
  {
    "letter": "ج",
    "question": "ما هو اسم الجبل الذي يقع في شبه الجزيرة العربية ويعتبر من أعلى الجبال فيها؟",
    "correctAnswer": "جبل السودة",
    "id": 297
  },
  {
    "letter": "ج",
    "question": "ما هي العاصمة الإدارية لدولة الجزائر؟",
    "correctAnswer": "الجزائر",
    "id": 298
  },
  {
    "letter": "ف",
    "question": "ما هي الفاكهة التي تُعرف بـ 'ملك الفواكه' ولها رائحة قوية ومميزة؟",
    "correctAnswer": "فاكهة الدوريان",
    "id": 299
  },
  {
    "letter": "م",
    "question": "ما هي الفاكهة الاستوائية التي تحتوي على فيتامين سي بكميات كبيرة وتستخدم في العصائر؟",
    "correctAnswer": "المانجو",
    "id": 300
  },
  {
    "letter": "م",
    "question": "ما هي الفاكهة التي تُعرف بـ 'التفاح الذهبي'؟",
    "correctAnswer": "المشمش",
    "id": 301
  },
  {
    "letter": "ق",
    "question": "ما هو النبات الذي يُزرع لاستخراج الألياف منه لصناعة الأقمشة؟",
    "correctAnswer": "القطن",
    "id": 302
  },
  {
    "letter": "ب",
    "question": "ما هو اسم العلم الذي يدرس الكائنات الحية وتفاعلاتها مع بيئتها؟",
    "correctAnswer": "البيولوجيا",
    "id": 303
  },
  {
    "letter": "ظ",
    "question": "ما هي المدينة العربية التي تُعرف باسم 'مدينة الضباب'؟",
    "correctAnswer": "الظهران",
    "id": 304
  },
  {
    "letter": "ي",
    "question": "ما هي الدولة الآسيوية التي تشتهر بأزهار الكرز؟",
    "correctAnswer": "اليابان",
    "id": 305
  },
  {
    "letter": "هـ",
    "question": "ما هي الدولة الأوروبية التي تشتهر بوجود العديد من القنوات المائية؟",
    "correctAnswer": "هولندا",
    "id": 306
  },
  {
    "letter": "ك",
    "question": "ما اسم الشجرة التي تُعرف بـ'ملك الغابة' وتنتج فاكهة استوائية صفراء؟",
    "correctAnswer": "الكمثرى",
    "id": 307
  },
  {
    "letter": "ك",
    "question": "ما اسم الزهرة التي تُعرف بجمالها ورائحتها العطرية، وتأتي بألوان متعددة مثل الأحمر والأصفر والأبيض؟",
    "correctAnswer": "الكركديه",
    "id": 308
  },
  {
    "letter": "ك",
    "question": "أي من الخضروات التالية يُستخدم عادة في تحضير الحساء ويُعرف بلونه الأخضر الداكن وأوراقه المجعدة؟",
    "correctAnswer": "الكرنب",
    "id": 309
  },
  {
    "letter": "ك",
    "question": "ما هو نوع الفاكهة الذي يتميز بقشرته الخشنة ولبه الأبيض أو الأصفر، ويُزرع بكثرة في المناطق الحارة؟",
    "correctAnswer": "الكاكا",
    "id": 310
  },
  {
    "letter": "ل",
    "question": "ما هو النبات الذي يُعرف بزهوره البنفسجية ورائحته المهدئة، ويُستخدم في صناعة الزيوت العطرية؟",
    "correctAnswer": "اللافندر",
    "id": 311
  },
  {
    "letter": "ل",
    "question": "ما اسم الشجرة التي تُنتج فاكهة صغيرة مستديرة ذات لون أحمر أو أصفر، وتُستخدم في صناعة المربى والعصائر؟",
    "correctAnswer": "الليمون",
    "id": 312
  },
  {
    "letter": "ل",
    "question": "ما هو النبات الذي يُستخدم في تزيين الحدائق ويتميز بأوراقه الكبيرة وزهوره الزاهية التي تظهر في الصيف؟",
    "correctAnswer": "اللوبيليا",
    "id": 313
  },
  {
    "letter": "ل",
    "question": "ما اسم الفاكهة التي تُعرف بشكلها البيضاوي وقشرتها الأرجوانية أو الخضراء، وتُستخدم في تحضير المشروبات والحلويات؟",
    "correctAnswer": "الليتشي",
    "id": 314
  },
  {
    "letter": "م",
    "question": "ما هي الشجرة التي تُنتج فاكهة استوائية حلوة وعصارية، وتُعد من أكثر الفواكه استهلاكًا في العالم؟",
    "correctAnswer": "المانجو",
    "id": 315
  },
  {
    "letter": "م",
    "question": "ما اسم النبات الذي يُستخدم في صناعة التوابل ويُعرف برائحته العطرية ونكهته المميزة في الأطعمة والمشروبات؟",
    "correctAnswer": "المردقوش",
    "id": 316
  },
  {
    "letter": "م",
    "question": "ما هو النبات الذي يُزرع في الصحاري ويُستخدم في صناعة الألياف، ويُعرف بقدرته على تحمل الجفاف؟",
    "correctAnswer": "الموز",
    "id": 317
  },
  {
    "letter": "م",
    "question": "أي من الخضروات التالية تُعد من الخضروات الورقية وتُستخدم في تحضير السلطات والسندويتشات؟",
    "correctAnswer": "الملفوف",
    "id": 318
  },
  {
    "letter": "م",
    "question": "ما اسم الزهرة التي تُعرف بجمالها وألوانها المتنوعة، وتُهدى في المناسبات السعيدة؟",
    "correctAnswer": "المسك",
    "id": 319
  },
  {
    "letter": "ق",
    "question": "ما اسم الفاكهة التي تُعرف بقشرتها الخضراء ولحمها الأحمر أو الأصفر، وتحتوي على نسبة عالية من الماء؟",
    "correctAnswer": "القرع",
    "id": 320
  },
  {
    "letter": "ق",
    "question": "ما هو النبات الذي يُستخدم في صناعة البهارات ويُعرف بلونه الأصفر ورائحته النفاذة؟",
    "correctAnswer": "القرنفل",
    "id": 321
  },
  {
    "letter": "ق",
    "question": "ما اسم الزهرة التي تُعرف بجمالها وألوانها الزاهية، وتُزرع في الحدائق والبساتين؟",
    "correctAnswer": "القرنفل",
    "id": 322
  },
  {
    "letter": "ق",
    "question": "أي من الخضروات التالية يُستخدم في تحضير الأطباق الشرقية ويُعرف بلونه الأخضر وشكله الطويل؟",
    "correctAnswer": "القلقاس",
    "id": 323
  },
  {
    "letter": "ق",
    "question": "ما هو النبات الذي يُستخدم في صناعة المشروبات الساخنة ويُعرف بحبوبه المحمصة؟",
    "correctAnswer": "القهوة",
    "id": 324
  },
  {
    "letter": "ج",
    "question": "ما هو الجزء من النبات الذي يمتص الماء والمعادن من التربة؟",
    "correctAnswer": "الجذر",
    "id": 325
  },
  {
    "letter": "ج",
    "question": "ما هو اسم القوة التي تسحب الأجسام نحو مركز الأرض؟",
    "correctAnswer": "الجاذبية",
    "id": 326
  },
  {
    "letter": "ن",
    "question": "ما هو النبات الذي يُعرف بـ 'ملك الفاكهة' وله رائحة قوية ومميزة؟",
    "correctAnswer": "النبات الدوريان",
    "id": 327
  },
  {
    "letter": "ن",
    "question": "ما اسم الشجرة التي تنتج ثمارًا تُستخدم لصنع الزيت وتشتهر بكونها رمزًا للسلام؟",
    "correctAnswer": "النخلة",
    "id": 328
  },
  {
    "letter": "ث",
    "question": "ما هو النبات الذي يُعرف بأنه من البقوليات ويُستخدم في تحضير الحساء والعدس؟",
    "correctAnswer": "الثوم",
    "id": 329
  },
  {
    "letter": "ب",
    "question": "ما هو النبات الذي يُعرف بأنه من البقوليات ويُستخدم في تحضير الفول المدمس؟",
    "correctAnswer": "البقوليات",
    "id": 330
  },
  {
    "letter": "ب",
    "question": "ما هو النبات الذي يُستخدم في صناعة القهوة ويُعرف بكونه مصدرًا للمنبهات؟",
    "correctAnswer": "البن",
    "id": 331
  }
]
  ;

export function getQuestionByLetter(letter: string): QuestionData | undefined {
  const normalizedLetter = letter === 'ه' ? 'هـ' : letter;
  return QUESTIONS_DATA.find((q) => q.letter === letter || q.letter === normalizedLetter);
}

